In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame((
    ('key1', 'val1'),
    ('key2', 'val2'),
    ('key3', 'val3'),
    ('key4', 'val4'),
), columns=['key col', 'value col'])

In [3]:
df1

  key col value col
0    key1      val1
1    key2      val2
2    key3      val3
3    key4      val4

In [4]:
df2 = pd.DataFrame((
    ('key1', 'val1'),
    ('key2', 'val2'),
    ('key3', 'val33'),
    ('key3', 'val333'),
), columns=['key col', 'value col 2'])

In [5]:
df2

  key col value col 2
0    key1        val1
1    key2        val2
2    key3       val33
3    key3      val333

In [6]:
pd.merge(df1, df2, on='key col', how='left')

  key col value col value col 2
0    key1      val1        val1
1    key2      val2        val2
2    key3      val3       val33
3    key3      val3      val333
4    key4      val4         NaN